Revit 2027 API
FormulaEditingEventArgs Class
 The event arguments used by the DocumentSaving event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.UI.Events.FormulaEditingEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FormulaEditingEventArgs : RevitAPIPreEventArgs
Public Class FormulaEditingEventArgs
	Inherits RevitAPIPreEventArgs
public ref class FormulaEditingEventArgs : public RevitAPIPreEventArgs
type FormulaEditingEventArgs =
    class
        inherit RevitAPIPreEventArgs
    end
The FormulaEditingEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
CurrentDocument |  Returns the current document
Formula |  Returns text of the formula that will be modified
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
ParameterId |  Returns the Id of the modified parameter
Top
Methods
Name | Description
Apply |  Applies formula to the parameter
Cancel |  When the event is cancellable, may call the Cancel() method to cancel it.
(Inherited from RevitAPIPreEventArgs)
Dispose
(Inherited from RevitAPIEventArgs)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsCancelled |  Indicates whether the event is being cancelled.
(Inherited from RevitAPIEventArgs)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace